<a href="https://colab.research.google.com/github/sameerCoder/DATA_ANALYST_DATASETS/blob/main/copy_DS_with_Python_Pandas_04.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
print([i for i in range(100,500,50)])
print(chr(65))

[100, 150, 200, 250, 300, 350, 400, 450]
A
[100, 150, 200, 250, 300, 350, 400, 450]
A

In [ ]:
#create 1 d series

import pandas as pd
s1=pd.Series(data=[i for i in range(100,510,50)], index=[chr(i) for i in range(65,65+9)])
print(s1)

A    100
B    150
C    200
D    250
E    300
F    350
G    400
H    450
I    500
dtype: int64

In [ ]:
print(s1.index)

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'], dtype='object')

In [ ]:
#selecting col
print(s1['B'])
print(s1.loc['B'])

150
150

In [ ]:
#select multicols

print(s1[['B','C','D']])
print("*"*25)
print(s1.loc[['B','C','D']])

B    150
C    200
D    250
dtype: int64
*************************
B    150
C    200
D    250
dtype: int64

In [ ]:
#selecting rows with INDEX NUMBER.
print(s1)
print()
print("s1['A']:",s1['A'])
print("s1.iloc[2]:",s1.iloc[2])
print("s1.iloc[[1,2,3,7]]:",s1.iloc[[1,2,3,7]])

A    100
B    150
C    200
D    250
E    300
F    350
G    400
H    450
I    500
dtype: int64

s1['A']: 100
s1.iloc[2]: 200
s1.iloc[[1,2,3,7]]: B    150
C    200
D    250
H    450
dtype: int64

In [ ]:
'B' in s1

True

In [ ]:
100 in s1
#match only the index value.

False

In [ ]:
print(s1*2)

A     200
B     300
C     400
D     500
E     600
F     700
G     800
H     900
I    1000
dtype: int64

In [ ]:
print(s1**2)

A     10000
B     22500
C     40000
D     62500
E     90000
F    122500
G    160000
H    202500
I    250000
dtype: int64

In [ ]:
s2mix_dtype=pd.Series(data=[1,2,3,"hi","hello","msatutorpy@gmail.com"],index=[i for i in range(100,100+6)])
print(s2mix_dtype)

100                       1
101                       2
102                       3
103                      hi
104                   hello
105    msatutorpy@gmail.com
dtype: object

In [ ]:
#??????????????????????????
print(s2mix_dtype*2)

100                                           2
101                                           4
102                                           6
103                                        hihi
104                                  hellohello
105    msatutorpy@gmail.commsatutorpy@gmail.com
dtype: object

In [ ]:
print(s2mix_dtype.iloc[[0,1,2]]*2)

100    2
101    4
102    6
dtype: object

In [ ]:
#creating DataFrame 
import pandas as pd
datadict={'one':[i for i in range(20,30)],
          'two':[i for i in range(30,40)],
           'three':[i for i in range(40,50)]}

df1=pd.DataFrame(data=datadict)
print(df1)

   one  two  three
0   20   30     40
1   21   31     41
2   22   32     42
3   23   33     43
4   24   34     44
5   25   35     45
6   26   36     46
7   27   37     47
8   28   38     48
9   29   39     49

In [ ]:
print(df1['three'])

0    40
1    41
2    42
3    43
4    44
5    45
6    46
7    47
8    48
9    49
Name: three, dtype: int64

In [ ]:
df1[['one','two']]

   one  two
0   20   30
1   21   31
2   22   32
3   23   33
4   24   34
5   25   35
6   26   36
7   27   37
8   28   38
9   29   39

In [ ]:
df1.loc[1]

one      21
two      31
three    41
Name: 1, dtype: int64

In [ ]:
df1.iloc[1]

one      21
two      31
three    41
Name: 1, dtype: int64

In [ ]:
df2=pd.DataFrame(data=datadict,index=["row"+str(i) for i in range(10)])
print(df2)

      one  two  three
row0   20   30     40
row1   21   31     41
row2   22   32     42
row3   23   33     43
row4   24   34     44
row5   25   35     45
row6   26   36     46
row7   27   37     47
row8   28   38     48
row9   29   39     49

In [ ]:
print(df1.head(3))
print("")
print(df1.tail(3))

   one  two  three
0   20   30     40
1   21   31     41
2   22   32     42

   one  two  three
7   27   37     47
8   28   38     48
9   29   39     49

In [ ]:
print(df1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     10 non-null     int64
 1   two     10 non-null     int64
 2   three   10 non-null     int64
dtypes: int64(3)
memory usage: 368.0 bytes
None

In [ ]:
print(df1.describe())

            one       two     three
count  10.00000  10.00000  10.00000
mean   24.50000  34.50000  44.50000
std     3.02765   3.02765   3.02765
min    20.00000  30.00000  40.00000
25%    22.25000  32.25000  42.25000
50%    24.50000  34.50000  44.50000
75%    26.75000  36.75000  46.75000
max    29.00000  39.00000  49.00000

In [ ]:
#colume fetching
df1['one']

0    20
1    21
2    22
3    23
4    24
5    25
6    26
7    27
8    28
9    29
Name: one, dtype: int64

In [ ]:
#colume fetching
df1.one#one column

0    20
1    21
2    22
3    23
4    24
5    25
6    26
7    27
8    28
9    29
Name: one, dtype: int64

In [ ]:
#MUltiple colume fetching

df1[['one',
    'three']]

   one  three
0   20     40
1   21     41
2   22     42
3   23     43
4   24     44
5   25     45
6   26     46
7   27     47
8   28     48
9   29     49

In [ ]:
df2.loc['row1']

one      21
two      31
three    41
Name: row1, dtype: int64

In [ ]:
df2.loc[['row1','row2']]

      one  two  three
row1   21   31     41
row2   22   32     42

In [ ]:
df2.iloc[[1,7]]

      one  two  three
row1   21   31     41
row7   27   37     47

In [ ]:
#Row fetching
df1.iloc[[1,7]]

   one  two  three
1   21   31     41
7   27   37     47

In [ ]:
#new small subset dataframe.

subsetdf1=df1[['one','three']]
print(subsetdf1)

   one  three
0   20     40
1   21     41
2   22     42
3   23     43
4   24     44
5   25     45
6   26     46
7   27     47
8   28     48
9   29     49

In [ ]:
copydf1=df1.copy()
print(copydf1)

   one  two  three
0   20   30     40
1   21   31     41
2   22   32     42
3   23   33     43
4   24   34     44
5   25   35     45
6   26   36     46
7   27   37     47
8   28   38     48
9   29   39     49

In [ ]:
copydf1['newcolumn']=df1['three']+2
print(copydf1)

   one  two  three  newcolumn
0   20   30     40         40
1   21   31     41         41
2   22   32     42         42
3   23   33     43         43
4   24   34     44         44
5   25   35     45         45
6   26   36     46         46
7   27   37     47         47
8   28   38     48         48
9   29   39     49         49

In [ ]:
import numpy as np
#create new columns and insert nan value.
copydf1['Newcol']=np.nan
print(copydf1)

   one  two  three  newcolumn  Newcol
0   20   30     40         40     NaN
1   21   31     41         41     NaN
2   22   32     42         42     NaN
3   23   33     43         43     NaN
4   24   34     44         44     NaN
5   25   35     45         45     NaN
6   26   36     46         46     NaN
7   27   37     47         47     NaN
8   28   38     48         48     NaN
9   29   39     49         49     NaN

In [ ]:
#whole one row
copydf1.iloc[1]=55555
print(copydf1)

     one  newinsertcol    two  three  newcolumn   Newcol
0     20           100     30     40         40      NaN
1  55555         55555  55555  55555      55555  55555.0
2     22           120     32     42         42      NaN
3     23           130     33     43         43      NaN
4     24           140     34     44         44      NaN
5     25           150     35     45         45      NaN
6     26           160     36     46         46      NaN
7     27           170     37     47         47      NaN
8     28           180     38     48         48      NaN
9     29           190     39     49         49      NaN

In [ ]:
#PARTICULAR ROW PARTICULAR COLUMN
#???????????????????????????????????????
copydf1.iloc[2,3]=999
print(copydf1)
#print(copydf1.iloc[2,3]=9999,inplace=True)

     one  newinsertcol    two  three  newcolumn   Newcol
0     20           100     30     40         40      NaN
1  55555         55555  55555  55555      55555  55555.0
2     22           120     32    999         42      NaN
3     23           130     33     43         43      NaN
4     24           140     34     44         44      NaN
5     25           150     35     45         45      NaN
6     26           160     36     46         46      NaN
7     27           170     37     47         47      NaN
8     28           180     38     48         48      NaN
9     29           190     39     49         49      NaN

In [ ]:
#query
copydfquery=copydf1['two']>160
print(copydfquery)
print(copydf1[copydfquery])
print(copydf1[copydf1['two']>160])

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: two, dtype: bool
     one  newinsertcol    two  three  newcolumn   Newcol
1  55555         55555  55555  55555      55555  55555.0

In [ ]:
print(df1.loc[1])
print()
print(df1['one'])

one      21
two      31
three    41
Name: 1, dtype: int64

0    20
1    21
2    22
3    23
4    24
5    25
6    26
7    27
8    28
9    29
Name: one, dtype: int64

In [ ]:
#ADD ANY LOCATION I WILL ADD THE COLUMN.
#df.insert(columnlocation,column_name,column_value)
copydf1.insert(1,'newinsertcol',[i for i in range(100,200,10)])
print(copydf1)

   one  newinsertcol  two  three  newcolumn  Newcol
0   20           100   30     40         40     NaN
1   21           110   31     41         41     NaN
2   22           120   32     42         42     NaN
3   23           130   33     43         43     NaN
4   24           140   34     44         44     NaN
5   25           150   35     45         45     NaN
6   26           160   36     46         46     NaN
7   27           170   37     47         47     NaN
8   28           180   38     48         48     NaN
9   29           190   39     49         49     NaN

In [ ]:
copydf1.insert(5,'copyofone',copydf1['one'])
print(copydf1)

     one  newinsertcol    two  three   Newcol  copyofone
0     20           100     30     40      NaN         20
1  55555           110  55555  55555  55555.0      55555
2     22           120     32     42      NaN         22
3     23           130    999     43      NaN         23
4     24           140     34     44      NaN         24
5     25           150     35     45      NaN         25
6     26           160     36     46      NaN         26
7     27           170     37     47      NaN         27
8     28           180     38     48      NaN         28
9     29           190     39     49      NaN         29

In [ ]:
#insert at particular cell/ particular row & col.
copydf1.at[3,'two']=999
print(copydf1)

     one  newinsertcol    two  three   Newcol
0     20           100     30     40      NaN
1  55555           110  55555  55555  55555.0
2     22           120     32     42      NaN
3     23           130    999     43      NaN
4     24           140     34     44      NaN
5     25           150     35     45      NaN
6     26           160     36     46      NaN
7     27           170     37     47      NaN
8     28           180     38     48      NaN
9     29           190     39     49      NaN

In [ ]:
print(copydf1.index)
print(copydf1.columns)

RangeIndex(start=0, stop=10, step=1)
Index(['one', 'newinsertcol', 'two', 'three', 'Newcol'], dtype='object')

In [ ]:
print(copydf1)

     one  newinsertcol    two  three   Newcol
0     20           100     30     40      NaN
1  55555           110  55555  55555  55555.0
2     22           120     32     42      NaN
3     23           130    999     43      NaN
4     24           140     34     44      NaN
5     25           150     35     45      NaN
6     26           160     36     46      NaN
7     27           170     37     47      NaN
8     28           180     38     48      NaN
9     29           190     39     49      NaN

In [ ]:
data1=[i for i in range(15,20)]
data2=[i for i in range(20,25)]
df3=pd.DataFrame(data=zip(data1,data2),columns=['A','B'])
print(df3)

    A   B
0  15  20
1  16  21
2  17  22
3  18  23
4  19  24

In [ ]:
df3['Cnew']=df3['A']+df3['B']
print(df3)

    A   B  Cnew
0  15  20    35
1  16  21    37
2  17  22    39
3  18  23    41
4  19  24    43

In [ ]:
df3['flag']=df3['A']>17
print(df3)

    A   B  Cnew   flag
0  15  20    35  False
1  16  21    37  False
2  17  22    39  False
3  18  23    41   True
4  19  24    43   True

In [ ]:
df3['half-value-ofA']=df3['A'][:3]
print(df3)

    A   B  half-value-ofA
0  15  20            15.0
1  16  21            16.0
2  17  22            17.0
3  18  23             NaN
4  19  24             NaN

In [ ]:
#delete
df3.pop('Cnew')
print(df3)

    A   B   flag
0  15  20  False
1  16  21  False
2  17  22  False
3  18  23   True
4  19  24   True

In [ ]:
del df3['flag']
print(df3)

    A   B
0  15  20
1  16  21
2  17  22
3  18  23
4  19  24

In [ ]:
################################